/*   Component 인터페이스로 Composite class 구현   */
// 태그 저장 변수
// 요소 객체를 저장할 리스트 선언
// Composite class 초기화
// 인자로 받은 태그 저장

// 자식요소 추가 메소드 구현
// 요소 객체 리스트에 추가

// 자식요소 제거 메소드 구현
// 요소 객체 리스트에서 제거

// i번째 자식요소 가져오기 메소드 구현
// 자식요소 리스트의 크기가 i보다 크다면
// i번째 자식요소를 목록에서 선택해 리턴
// 아니라면 null 리턴

// 태그 getter 구현
// 태그 리턴

//값 getter 구현
// 경로를 저장할 변수 선언 및 초기화
// 요소 객체 저장 리스트 크기만큼 반복
// 현재 접근중인 요소객체 저장
// 현재 접근중인 요소객체의 태그 및 값을 경로저장 변수에 누적 
// 경로저장 변수 리턴

// 일반출력 메소드 구현
// 태그 + 값 출력

// i번째 자식요소 출력 메소드 구현
// i만큼 반복
// 공백 출력
// "D: " + 태그 출력
// 요소객체 저장 리스트 크기만큼 반복
// 현재 접근중인 요소객체 저장
// 현재 번호 + ". " 출력
// 선택한 i번째 자식요소 출력 